def user_interface():
    print("Введите запрос поиска")
    answer = input()
    # Пользователь вводит запрос, идет получение данных,
    # данные записываются в файл, и из них идет получение экземпляра класса.
    # Пользователю выводится меню, в котором есть функционал взаимодействия с пользователем.
    # Введите 1, чтобы вывести все вакансии, 2, чтобы отсоритровать вакансии по слову,
    # 3 чтоб вывести топ 5 по зарплате, введите 2, если хотите найти по компании, введите 6 чтобы выйти из поиска.


def top_vacancies():
    pass


def search_vacancies():
    pass


def get_vacancies_by_employer():
    pass
